Repository: AlticeLabsProjects/meocloudsdk-cocoa
Catalog: MEOCloudSDK/MEOCloudSDK/Resources/Strings/*.lproj/Localizable.strings
Languages: pt_pt

source: Error
pt_pt: Erro

source: file
pt_pt: ficheiro

source: folder
pt_pt: pasta

source: That file
pt_pt: Esse ficheiro

source: That folder
pt_pt: Essa pasta

# CLDErrorCodeUnknownError
source: An unknown error has occurred.
pt_pt: Erro desconhecido.

# CLDErrorCodeUnauthorized
source: You are not authorized to perform this operation.
pt_pt: Não tem autorização para executar essa operação.

# CLDErrorCodeAccessForbidden
source: You do not have permission to perform this operation.
pt_pt: Não tem permissão para executar essa operação.

# CLDErrorCodeInvalidResponse
source: The server provided an invalid response.
pt_pt: O servidor devolveu uma resposta inválida.

# CLDErrorCodeTooManyRecords
source: The server cannot perform this operation on so many files at once.
pt_pt: Demasiados ficheiros.

# CLDErrorCodeOverQuota
source: Your account ran out of space.
pt_pt: Não tem espaço livre na sua conta.

# CLDErrorCodeResourceNotFound
source: The requested item could not be found.
pt_pt: Item não encontrado.

# CLDErrorCodeResourceAlreadyExists
source: %@ already exists.
pt_pt: %@ já existe.

# CLDErrorCodeSessionNotLinked
source: User not authenticated.
pt_pt: Utilizador não autênticado.

# CLDErrorCodeSessionAlreadyLinked
source: User already authenticated.
pt_pt: Utilizador já se encontra autênticado.

# CLDErrorCodeMissingWindow
source: Could not find a window to show the content.
pt_pt: Não foi possível encontrar uma janela disponível.

# CLDErrorCodeConnectionTimedOut
source: Connection timed out.
pt_pt: A ligação excedeu o tempo limite.

# CLDErrorCodeConnectionFailed
source: Failed to connect to the server.
pt_pt: Não foi possível estabelecer ligação com o servidor.

# CLDErrorCodeServerCouldNotCreateThumbnail
source: Server could not create thumbnail for the file.
pt_pt: Não foi possível gerar pré-visualização do ficheiro.

# CLDErrorCodeInvalidItem
source: Item is not valid for transfering.
pt_pt: Ficheiro não é válido para transferências.

# CLDErrorCodeInvalidParameters
source: Invalid parameters sent to server.
pt_pt: Foram enviados parâmetros inválidos ao servidor.

# CLDErrorCancelledByUser
source: Operation cancelled by user.
pt_pt: Operação cancelada pelo utilizador.
